const pattern = [
    ["43044", "例の五桁"],
    ["40298", "例の五桁"],
    ["です。", "ナリ "],
    ["ですよ", "ナリよ "],
    ["いわ", "ナリよ"],
    ["するよ", "するナリよ"],
    ["だよ", "ナリよ"],
    ["私", "当職"],
    ["僕", "当職"],
    ["俺", "当職"],
    ["ワイ", "当職"],
    ["あなた", "貴職"],
    ["君", "貴職"],
    ["唐澤貴洋", "例のパカ弁"],   
    ["出来る？", "それは出来るよね？"],
    ["答え合わせ理論", "ヒットマーク理論"],
    ["掲示板", "ケー"], 
    ["糖質", "甘芋"],
    ["統合失調症", "甘芋"],
    ["統失", "甘芋"],
]; // replace([0], [1])

export function parseLegal(japanse: string): string {

    // 43044
    // 40298

    for (let i = 0; i < pattern.length; i++) {
        const r = new RegExp(pattern[i][0], "g")
        japanse = japanse.replace(r, pattern[i][1]);
    }



    return japanse;
}